app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'NC-17') ORDER BY release_date
---
  def index
    @all_ratings = Movie.rating

    if @sorts == "title"
      order = {:order => 'title'}
    elsif @sorts == "release_date"
      order = {:order => 'release_date'}
    end
    @checked = params[:ratings] || session[:ratings]
    @sorts = params[:sorting] || session[:sorting] || {}
    if params[:sorting] != session[:sorting]
      session[:sorting] = @sorts
      redirect_to :sorting => @sorts, :ratings => @checked and return
    end

    if params[:ratings] != session[:ratings] and @checked != {}
      session[:sorting] = @sorts
      session[:ratings] = @checked
      redirect_to :sorting => @sorts, :ratings => @checked and return
    end

    @movies = Movie.find_all_by_rating(@checked.keys, order)